const express = require("express");

const cors = require("cors");

const bodyParser = require("body-parser");

const jsonParser = bodyParser.json();

const app = express();

app.use(cors());

const port = 8000;

let categories = [
  {
    id: 1,
    name: "Дэлхийн мэдээ",
  },
  {
    id: 2,
    name: "Гэмт хэрэг",
  },
  {
    id: 3,
    name: "Эерэг",
  },
];

let articles = [
  {
    id: "-T2fQMh2_66ceol8W_k6g",
    imageUrl:
      "https://eguur.mn/wp-content/uploads/2023/01/%D0%91%D0%B8%D0%B1%D0%B5%D1%80-%C2%A5-1024x642.jpeg",
    categoryId: 0,

    name: "hohoho",
    description:
      "Жастин Бибер өөрийн хөгжмийн эрхээ 200 сая ам.доллараар заржээ",
    text: "Жастин Бибер өөрийн хөгжмийн эрхийг Blackstone-ийн дэмжлэгтэй Hipgnosis Songs Capital-д 200 сая ам.доллараар зарсан тухай зарлалаа. Энэхүү гэрээнд Биберийн өөрийн хэвлэн нийтлэх болон бичсэн хөгжмийн сангийн хувьцаа, Биберийн хэвлэх зохиогчийн эрх, 2021 оны 12-р сарын 31-нээс өмнө гаргасан 290 гаруй эрхүүд багтсан болно. Биберийн дууг Universal Music үргэлжлүүлэн удирдан явуулах болно гэж эх сурвалжууд мэдээлэв. Түүний мастер бичлэгүүд мөнхөд UMG-ийн мэдэлд байх болно.",
  },
  {
    id: "ZmcbGttLi-49h4wZUdfxt",
    imageUrl: "https://eguur.mn/wp-content/uploads/2023/01/huuli-1-768x512.jpg",
    categoryId: 1,
    name: "hohoho",
    description:
      "Төрсөн эгчдээ архи өглөө гэж бусдыг зодсон хүүг ялаас чөлөөллөө",
    text: `Өсвөр насны хүү Х нь Э гэгчийг төрсөн эгчдээ архи өгсөн гэх шалтгаанаар зодсон.
     Үүний улмаас Э-гийн зовхинд цус хуралт, зөөлөн эдийн няцрал, дух, уруул, баруун бугуй, 
     зүүн сарвуунд зулгаралт бүхий хөнгөн хохирол учруулсан үйлдэлд прокуророос Эрүүгийн 
     хуулийн тусгай ангийн 11.6 дугаар зүйлийн 1 дэх хэсэгт заасан Хүний эрүүл мэндэд 
     хөнгөн хохирол санаатай учруулсан гэмт хэрэгт холбогдуулан яллах дүгнэлт үйлдэн шүүхэд шилжүүлжээ.

Шүүх хавтаст хэрэгт авагдсан баримтууд болон хэргийн үйл баримтад дүгнэлт хийн, 
өсвөр насны шүүгдэгчийг гэмт хэрэг үйлдсэн гэм буруутайд тооцож, шүүгдэгчийг ялаас чөлөөлж шийдвэрлэв.  

Учир нь Эрүүгийн хуулийн тусгай ангийн 11.6 дугаар зүйлийн 1 дэх хэсэгт заасан 
гэмт хэрэг нь хүний эрүүл мэндийн халдашгүй байдлын эсрэг гэмт хэрэг бөгөөд гэмт 
этгээд нь хохирогчийн бие махбод буюу эрүүл мэндэд Шүүх эмнэлгийн гэмтлийн зэрэг 
тогтоох журамд заасан хөнгөн гэмтлийг санаатай учруулсан байх шинжийг шаарддаг ба
 шүүх хуралдааны явцад өсвөр насны шүүгдэгч нь хохирогчийг төрсөн эгчид нь архи 
 уулгасан гэх шалтгаанаар зодсон гэдгээ хүлээн зөвшөөрсөн, шүүх эмнэлгийн шинжээчийн 
 дүгнэлтээр хохирогч Э-н эрүүл мэндэд хөнгөн хохирол учирсан болох нь тогтоогдсон тул 
 өсвөр насны шүүгдэгч Х-г Эрүүгийн хуулийн тусгай ангийн 11.6 дугаар зүйлийн 1 дэх хэсэгт 
 заасан Хүний эрүүл мэндэд хөнгөн хохирол санаатай учруулсан гэмт хэрэг үйлдсэн гэм буруутайд тооцсон байна.


Харин өсвөр насны шүүгдэгчид оногдуулах эрүүгийн хариуцлагын тухайд, 
Эрүүгийн хуулийн ерөнхий ангийн 6.1 дүгээр зүйлийн 2 дахь хэсэгт 
Эрүүгийн хариуцлага хүлээлгэхэд гэмт хэрэг үйлдсэн нөхцөл байдал, учирсан 
хохирол, хор уршгийн шинж чанар, гэмт хэрэг үйлдсэн хүний хувийн байдал,
 эрүүгийн хариуцлагыг хөнгөрүүлэх, хүндрүүлэх нөхцөл байдлыг тал бүрээс нь
  харгалзан үзнэ гэж, мөн хуулийн 6.7 дугаар зүйлийн 1 дэх хэсэгт Шүүх гэмт хэрэг үйлдсэн нь тогтоогдсон,
   гэм буруугаа хүлээн зөвшөөрсөн хүний гэмт хэрэг үйлдсэн нөхцөл байдал,
    учруулсан хохирол, хор уршгийн шинж чанар, хувийн байдал, мөрдөн шалгах 
    ажиллагааг шуурхай явуулж гэмт хэргийг нотлоход дэмжлэг үзүүлсэн байдлыг 
    харгалзан дараах байдлаар эрүүгийн хариуцлагыг хөнгөрүүлж, эсхүл эрүүгийн хариуцлагаас чөлөөлж болно 
гэж тус тус заасан ба хавтаст хэрэгт авагдсан баримтуудаар шүүгдэгчийн 
төрсөн эгч болох М, хохирогч Э нар нь оюуны хүндэвтэр хомсдолтой болох нь тогтоогдсон мөн хохирогч 
Э-г хөгжлийн бэрхшээлтэй буюу оюуны хүндэвтэр хомсдолтой болохыг өсвөр насны шүүгдэгч мэдээгүй, 
харин хохирогчийг түүний төрсөн эгчийн оюуны хомсдолтой байдлыг далимдуулан архи уулгасан гэж 
бодсоны улмаас хохирогчийг зодож, эрүүл мэндэд нь хохирол учруулсан үйл баримт тогтоогдсон 
буюу өсвөр насны шүүгдэгчийн хувийн байдал, гэмт хэрэг үйлдсэн нөхцөл байдал, гэмт хэргийн 
нийгмийн аюулын шинж чанар, мөн өсвөр насны шүүгдэгчийн анх удаа хөнгөн гэмт хэрэгт холбогдсон 
байдал, мөрдөн шалгах ажиллагааны явцад болон шүүх хуралдаанд гэм буруугаа хүлээн зөвшөөрсөн, 
хохирогчид учирсан хохирлыг төлж барагдуулсан зэрэг нөхцөл байдлыг харгалзан өсвөр насны 
шүүгдэгчийг ялаас чөлөөлж шийдвэрлэв.

`,
  },
  {
    id: "qmH91Z4UoHCLitEfuN2QN",
    imageUrl: "https://eguur.mn/wp-content/uploads/2023/01/tsagdaa.jpg",
    categoryId: 2,
    name: "hohoho",
    description:
      "Групп чатад хүүхдүүдийг нэмж, садар самуунд уруу татсан этгээдэд ял оноожээ",
    text: `Сүүлийн үед бага насны хүүхдийг цахим орчныг ашиглан биеэ үнэлүүлэх, садар самуунд уруу татах гэмт хэргүүд үйлдэгдсээр байна.

Тухайлбал, иргэн Э нь фэйсбүүкийн хуурамч хаягуудыг ашиглан “ХҮҮХДҮҮД” нэртэй нууц групп чат 2022 оны 02 дугаар сард шинээр нээж тус групп чатанд бага, өсвөр насны хүүхдүүдийн садар самуун агууламж бүхий дүрс, бичлэгийг байршуулж, хадгалсан.

Улмаар “ХҮҮХДҮҮД” нэртэй групп чатанд төлбөртэйгээр иргэдийг оруулж бага, өсвөр насны хүүхдүүдийн садар самуун агууламж бүхий дүрс, бичлэгийг үзүүлсэн хэргийг үйлджээ.

Баянзүрх дүүргийн Эрүүгийн хэргийн анхан шатны шүүхийн тогтоолоор Эрүүгийн хуулийн тусгай ангийн 16.9 дүгээр зүйлийн 2 дахь хэсгийн 2.1 дэх хэсгээр 2 жилийн хорих ял оногдуулсан байна.`,
  },

  {
    id: "fPb_Lf8489StXkk0Yj3dV",
    imageUrl: "https://eguur.mn/wp-content/uploads/2023/01/eco-tulsh-vcd.jpg",
    categoryId: 3,
    name: "hohoho",
    description:
      "М.Цэнгүүн: Хаягдал цаас, үртэс, тосоор утаагүй, эко түлш үйлдвэрлэдэг",
    text: `-Эрдэнэтээс өөр аймгуудад болон хот руу үйлдвэрлэлээ тэлэх боломж бий юу?

-Ойрын гурван жилдээ Эрдэнэтийн айл өрхүүдээ энэхүү түлшээр бүрэн хангах зорилго тавин ажиллаж байна. Өөрөөр хэлбэл бусад аймаг болон нийслэл рүү өргөжүүлж чадаагүй байгаа. Бид өнгөрсөн зургаадугаар сард гарааны бизнес төслийн уралдаанд оролцож шалгараад 40 сая төгрөгийн дэмжлэг авч үйлдвэрийн тоног төхөөрөмж зэрэг асуудлуудаа шийдэж эхэлсэн. Мөн аравдугаар сард гэр бүл хүүхэд залуучуудын газраас зохион байгуулсан "NextGen-2022" улсын уралдаанд амжилттай оролцож 20 сая төгрөгийн буцалтгүй дэмжлэг авч чадсан.

-Цаасны олдоц хангалттай хэмжээнд байж чадаж байна уу?

-Цаасны хаягдал ихээр гардаг томоохон газруудтай хамтарч ажилладаг болсон. Өөрөөр хэлбэл хогийн цэгт хаяулахгүйгээр бид өөрсдөө очоод худалдаад авчихдаг. Хотод бол 1 тонн цаасыг 200 мянган төгрөгөөр ч юм уу авдаг бол энд 500-600 кг цаасыг 10 мянгаар авчих боломжтой. Ингэхдээ цаасны ямар ч төрлийн бүх хаягдлыг ашиглаж болдог. Ганц шаардлага нь бохир цаас байж болохгүй.

-Эко түлшнээс өөр үйлдвэрлэж байгаа ямар нэгэн зүйл бий юу?

-Хаягдал цаас, ургамлын болон малын гаралтай хаягдал тосоор бүх төрлийн түлшийг богино хугацаанд асаах эко галлагч бүтээсэн. Энэ бүтээгдэхүүнийг 1000 төгрөгөөр худалдаж аваад нэг сар хэрэглэх болмжтой. Мөн аргалаас газ гаргах технологийг туршиж байна.`,
  },
];

let nextCarId = articles.length;

app.get("/categories", (request, response) => {
  response.status(200);
  response.json(categories);
});

app.get("/articles", (request, response) => {
  response.status(200);
  response.json(articles);
});

app.get("/articles/:id", (req, res) => {
  const { id } = req.params;
  let result;
  for (const art of articles) {
    console.log(art.id);
    if (art.id === id) {
      result = art;
    }
  }
  res.json(result);
});

app.delete("/articles/:id", (res, req) => {
  const { id } = req.params;
  articles = articles.filter((art) => art.id !== id);
  res.json(id);
});

app.post("/articles", jsonParser, (req, res) => {
  const { name } = req.body;
  const newArticles = { id: nextCarId++, name };
  articles.push(newArticles);
  res.send(newArticles);
});

app.listen(port, () => {
  console.log("http//localhost:" + port);
});
